In [1]:
import pandas as pd

In [60]:
df = pd.read_csv('emp.csv')

In [26]:
df.iloc[[2,11]]

    eno  ename  salary  deptno        doj
2     8  Sagar  1000.0      20 2020-11-30
11   12  Karan  2200.0      20 2018-06-16

In [14]:
df.dtypes

eno                int64
ename             object
salary             int64
deptno             int64
doj       datetime64[ns]
dtype: object

In [27]:
df['doj'].dt.year

0     2018
1     2017
2     2020
3     2019
4     2021
5     2016
6     2023
7     2015
8     2020
9     2017
10    2024
11    2018
12    2019
13    2022
14    2021
15    2016
Name: doj, dtype: int32

In [33]:
df1

                           eno  ename  salary  deptno         doj
0                           10  Amber  1000.0    10.0  2018-05-14
1                            2   Amar  1000.0    10.0  2017-03-22
2                            8  Sagar  1000.0    20.0  2020-11-30
3  4,Thomas,1000,10,2019-08-18    NaN     NaN     NaN         NaN

In [36]:
for i in df:
    print(i)

   eno   ename  salary  deptno        doj
5    6   Smith  1000.0      10 2016-12-01
6    7  Robert  3000.0      20 2023-06-25
7    3    Nick  1000.0      30 2015-09-15
8    9   Naman  4000.0      30 2020-01-20
9    1   Vikas  1000.0      30 2017-10-03
    eno   ename   salary  deptno        doj
10   11  Dennis  41000.0      30 2024-01-05
11   12   Karan   2200.0      20 2018-06-16
12   13  Simran   1500.0      10 2019-12-19
13   14    Amit   2000.0      30 2022-04-09
14   15    Neha   1700.0      20 2021-07-22
    eno  ename  salary  deptno        doj
15   16  Rahul  1200.0      10 2016-03-28

In [42]:
for i in df:
    print(i)

   eno   ename   salary  deptno         doj
0    1   Vikas   1000.0      30  2017-10-03
1   11  Dennis  41000.0      30  2024-01-05
2   12   Karan   2200.0      20  2018-06-16
3   13  Simran   1500.0      10  2019-12-19
4   14    Amit   2000.0      30  2022-04-09
   eno  ename  salary  deptno         doj
5   15   Neha  1700.0      20  2021-07-22
6   16  Rahul  1200.0      10  2016-03-28

In [44]:
df['eno']

TypeError: 'TextFileReader' object is not subscriptable

In [45]:
df_1 = pd.read_csv('departments.csv')

In [52]:
df_1.iloc[1:3]

   deptno deptName
1      20       IT
2      30   Travel

In [53]:
df_ex = pd.read_excel('emp_read.xlsx')

In [54]:
df_ex

   empID EmpName  Salary
0    101   Akash    2000
1    102  Naresh    3000
2    103  Suresh    4000
3    104  Nikhil    5000
4    105   Akhil    2012

In [55]:
df_emp = pd.read_csv('employees_source.csv')

In [56]:
df_emp

   eno   ename  deptno
0    1    Ajay      10
1    2   Vijay      20
2    3  Mahesh      30
3    4  Thomas      40
4    5  Robert      50

In [57]:
df_10 = df_emp['deptno'] == 10

In [59]:
df_emp[df_10]

   eno ename  deptno
0    1  Ajay      10

In [61]:
df

    eno   ename  salary  deptno         doj
0    10   Amber    1000      10  2018-05-14
1     2    Amar    1000      10  2017-03-22
2     8   Sagar    1000      20  2020-11-30
3     4  Thomas    1000      10  2019-08-18
4     5    Jade    2000      10  2021-02-10
5     6   Smith    1000      10  2016-12-01
6     7  Robert    3000      20  2023-06-25
7     3    Nick    1000      30  2015-09-15
8     9   Naman    4000      30  2020-01-20
9     1   Vikas    1000      30  2017-10-03
10   11  Dennis   41000      30  2024-01-05
11   12   Karan    2200      20  2018-06-16
12   13  Simran    1500      10  2019-12-19
13   14    Amit    2000      30  2022-04-09
14   15    Neha    1700      20  2021-07-22
15   16   Rahul    1200      10  2016-03-28

In [62]:
df_10 = df['deptno'] == 10
df_50 = df['salary'] >3000

In [67]:
df_10_50 = df_10 | df_50

In [68]:
df[df_10_50]

    eno   ename  salary  deptno         doj
0    10   Amber    1000      10  2018-05-14
1     2    Amar    1000      10  2017-03-22
3     4  Thomas    1000      10  2019-08-18
4     5    Jade    2000      10  2021-02-10
5     6   Smith    1000      10  2016-12-01
8     9   Naman    4000      30  2020-01-20
10   11  Dennis   41000      30  2024-01-05
12   13  Simran    1500      10  2019-12-19
15   16   Rahul    1200      10  2016-03-28

In [66]:
df[df_50]

    eno   ename  salary  deptno         doj
8     9   Naman    4000      30  2020-01-20
10   11  Dennis   41000      30  2024-01-05

In [71]:
df[(df['deptno'] == 10)|(df['salary'] >3000)]

    eno   ename  salary  deptno         doj
0    10   Amber    1000      10  2018-05-14
1     2    Amar    1000      10  2017-03-22
3     4  Thomas    1000      10  2019-08-18
4     5    Jade    2000      10  2021-02-10
5     6   Smith    1000      10  2016-12-01
8     9   Naman    4000      30  2020-01-20
10   11  Dennis   41000      30  2024-01-05
12   13  Simran    1500      10  2019-12-19
15   16   Rahul    1200      10  2016-03-28

In [72]:
df[(df['deptno'] == 10) | (df['deptno']==20)]

    eno   ename  salary  deptno         doj
0    10   Amber    1000      10  2018-05-14
1     2    Amar    1000      10  2017-03-22
2     8   Sagar    1000      20  2020-11-30
3     4  Thomas    1000      10  2019-08-18
4     5    Jade    2000      10  2021-02-10
5     6   Smith    1000      10  2016-12-01
6     7  Robert    3000      20  2023-06-25
11   12   Karan    2200      20  2018-06-16
12   13  Simran    1500      10  2019-12-19
14   15    Neha    1700      20  2021-07-22
15   16   Rahul    1200      10  2016-03-28

In [75]:
df_not_10 = df['deptno'] !=10

In [77]:
df[df_not_10]

    eno   ename  salary  deptno         doj
2     8   Sagar    1000      20  2020-11-30
6     7  Robert    3000      20  2023-06-25
7     3    Nick    1000      30  2015-09-15
8     9   Naman    4000      30  2020-01-20
9     1   Vikas    1000      30  2017-10-03
10   11  Dennis   41000      30  2024-01-05
11   12   Karan    2200      20  2018-06-16
13   14    Amit    2000      30  2022-04-09
14   15    Neha    1700      20  2021-07-22

In [80]:
df_sort = df.sort_values(by = ['deptno','salary'],ascending = [False,True])

In [81]:
df_sort

    eno   ename  salary  deptno         doj
7     3    Nick    1000      30  2015-09-15
9     1   Vikas    1000      30  2017-10-03
13   14    Amit    2000      30  2022-04-09
8     9   Naman    4000      30  2020-01-20
10   11  Dennis   41000      30  2024-01-05
2     8   Sagar    1000      20  2020-11-30
14   15    Neha    1700      20  2021-07-22
11   12   Karan    2200      20  2018-06-16
6     7  Robert    3000      20  2023-06-25
0    10   Amber    1000      10  2018-05-14
1     2    Amar    1000      10  2017-03-22
3     4  Thomas    1000      10  2019-08-18
5     6   Smith    1000      10  2016-12-01
15   16   Rahul    1200      10  2016-03-28
12   13  Simran    1500      10  2019-12-19
4     5    Jade    2000      10  2021-02-10

In [83]:
df.sort_index(ascending = False,inplace = True)

In [84]:
df

    eno   ename  salary  deptno         doj
15   16   Rahul    1200      10  2016-03-28
14   15    Neha    1700      20  2021-07-22
13   14    Amit    2000      30  2022-04-09
12   13  Simran    1500      10  2019-12-19
11   12   Karan    2200      20  2018-06-16
10   11  Dennis   41000      30  2024-01-05
9     1   Vikas    1000      30  2017-10-03
8     9   Naman    4000      30  2020-01-20
7     3    Nick    1000      30  2015-09-15
6     7  Robert    3000      20  2023-06-25
5     6   Smith    1000      10  2016-12-01
4     5    Jade    2000      10  2021-02-10
3     4  Thomas    1000      10  2019-08-18
2     8   Sagar    1000      20  2020-11-30
1     2    Amar    1000      10  2017-03-22
0    10   Amber    1000      10  2018-05-14

In [92]:
df_g = df.groupby('deptno')['salary'].sum().reset_index().rename(columns = {'salary':'sum_salary'})

In [93]:
df_g

   deptno  sum_salary
0      10        8700
1      20        7900
2      30       49000

In [106]:
df_e = df.groupby('deptno')['eno'].count()

In [107]:
df_h = df_e.apply(lambda x:x>5)

In [108]:
df_e_h = df_e[df_h].reset_index()

In [109]:
df_e_h

   deptno  eno
0      10    7

In [1]:
import pandas as pd

In [2]:
var = {'name':['raj','khumesh','ravindra'],
      'city':['pune','katngi','balaghat']}

In [9]:
df = pd.DataFrame(var)

In [10]:
type(df)

pandas.core.frame.DataFrame

In [2]:
df = pd.read_csv('emp.csv')

In [50]:
df_10 = df[df['deptno']==10]

In [51]:
df_10

    eno   ename  salary  deptno         doj
0    10   Amber    1000      10  2018-05-14
1     2    Amar    1000      10  2017-03-22
3     4  Thomas    1000      10  2019-08-18
4     5    Jade    2000      10  2021-02-10
5     6   Smith    1000      10  2016-12-01
12   13  Simran    1500      10  2019-12-19
15   16   Rahul    1200      10  2016-03-28

In [52]:
df_20 = df[df['deptno'] == 20]

In [53]:
df_20

    eno   ename  salary  deptno         doj
2     8   Sagar    1000      20  2020-11-30
6     7  Robert    3000      20  2023-06-25
11   12   Karan    2200      20  2018-06-16
14   15    Neha    1700      20  2021-07-22

In [57]:
df_sal_50 = df['salary'] < 5000

In [66]:
df_10_50 = df[(df['salary'] < 2000) | (df['deptno']==20) & (df['ename']=='Amber')]

In [67]:
df_10_50

    eno   ename  salary  deptno         doj
0    10   Amber    1000      10  2018-05-14
1     2    Amar    1000      10  2017-03-22
2     8   Sagar    1000      20  2020-11-30
3     4  Thomas    1000      10  2019-08-18
5     6   Smith    1000      10  2016-12-01
7     3    Nick    1000      30  2015-09-15
9     1   Vikas    1000      30  2017-10-03
12   13  Simran    1500      10  2019-12-19
14   15    Neha    1700      20  2021-07-22
15   16   Rahul    1200      10  2016-03-28

In [68]:
df_sort = df.sort_values(by=['deptno'],ascending = False)

In [69]:
df_sort

    eno   ename  salary  deptno         doj
7     3    Nick    1000      30  2015-09-15
10   11  Dennis   41000      30  2024-01-05
9     1   Vikas    1000      30  2017-10-03
8     9   Naman    4000      30  2020-01-20
13   14    Amit    2000      30  2022-04-09
2     8   Sagar    1000      20  2020-11-30
6     7  Robert    3000      20  2023-06-25
11   12   Karan    2200      20  2018-06-16
14   15    Neha    1700      20  2021-07-22
4     5    Jade    2000      10  2021-02-10
1     2    Amar    1000      10  2017-03-22
3     4  Thomas    1000      10  2019-08-18
0    10   Amber    1000      10  2018-05-14
5     6   Smith    1000      10  2016-12-01
12   13  Simran    1500      10  2019-12-19
15   16   Rahul    1200      10  2016-03-28

In [70]:
df_sort_index = df.sort_index(ascending = False)

In [71]:
df_sort_index

    eno   ename  salary  deptno         doj
15   16   Rahul    1200      10  2016-03-28
14   15    Neha    1700      20  2021-07-22
13   14    Amit    2000      30  2022-04-09
12   13  Simran    1500      10  2019-12-19
11   12   Karan    2200      20  2018-06-16
10   11  Dennis   41000      30  2024-01-05
9     1   Vikas    1000      30  2017-10-03
8     9   Naman    4000      30  2020-01-20
7     3    Nick    1000      30  2015-09-15
6     7  Robert    3000      20  2023-06-25
5     6   Smith    1000      10  2016-12-01
4     5    Jade    2000      10  2021-02-10
3     4  Thomas    1000      10  2019-08-18
2     8   Sagar    1000      20  2020-11-30
1     2    Amar    1000      10  2017-03-22
0    10   Amber    1000      10  2018-05-14

In [15]:
df_group = df.groupby('deptno')['salary'].sum()

In [16]:
df_having = df_group.apply(lambda x:x>20000)

In [19]:
df_grp_hvng = df_group[df_having].reset_index()

In [20]:
df_grp_hvng

   deptno  salary
0      30   49000

In [22]:
df_sort1 = df.sort_values(by=['salary','deptno'], ascending =[True,False])

In [23]:
df_sort1

    eno   ename  salary  deptno         doj
7     3    Nick    1000      30  2015-09-15
9     1   Vikas    1000      30  2017-10-03
2     8   Sagar    1000      20  2020-11-30
0    10   Amber    1000      10  2018-05-14
1     2    Amar    1000      10  2017-03-22
3     4  Thomas    1000      10  2019-08-18
5     6   Smith    1000      10  2016-12-01
15   16   Rahul    1200      10  2016-03-28
12   13  Simran    1500      10  2019-12-19
14   15    Neha    1700      20  2021-07-22
13   14    Amit    2000      30  2022-04-09
4     5    Jade    2000      10  2021-02-10
11   12   Karan    2200      20  2018-06-16
6     7  Robert    3000      20  2023-06-25
8     9   Naman    4000      30  2020-01-20
10   11  Dennis   41000      30  2024-01-05

In [24]:
df_agg = df.groupby('deptno')['salary'].agg(['sum','max','min','count']).reset_index()

In [25]:
df_agg

   deptno    sum    max   min  count
0      10   8700   2000  1000      7
1      20   7900   3000  1000      4
2      30  49000  41000  1000      5

In [26]:
df_dept = pd.read_csv('Departments.csv')

In [27]:
df_dept

   deptno deptName
0      10  Finance
1      20       IT
2      30   Travel
3      80    Forex

In [28]:
df_join = df.merge(df_dept,on='deptno',how='inner')

In [32]:
df_join1 = pd.merge(df,df_dept, on='deptno',how='left')

In [35]:
required_col_name = ['eno','ename']
df_join1[required_col_name]

    eno   ename
0    10   Amber
1     2    Amar
2     8   Sagar
3     4  Thomas
4     5    Jade
5     6   Smith
6     7  Robert
7     3    Nick
8     9   Naman
9     1   Vikas
10   11  Dennis
11   12   Karan
12   13  Simran
13   14    Amit
14   15    Neha
15   16   Rahul

In [43]:
df_sal = pd.read_csv('emp_skip_rows_file.csv')

In [48]:
df_concat = pd.concat([df_sal,df_dept],axis = 1)

In [49]:
df_concat

   Unnamed: 0  id   ename  salary  deptno        date  deptno deptName
0           0   1   Vikas    1000      30  2017-10-03    10.0  Finance
1           1  11  Dennis   41000      30  2024-01-05    20.0       IT
2           2  12   Karan    2200      20  2018-06-16    30.0   Travel
3           3  13  Simran    1500      10  2019-12-19    80.0    Forex
4           4  14    Amit    2000      30  2022-04-09     NaN      NaN

In [68]:
df_emp = pd.read_csv('employees_source.csv')

In [69]:
df_emp

   eno   ename  deptno
0    1    Ajay      10
1    2   Vijay      20
2    3  Mahesh      30
3    4  Thomas      40
4    6  Robert      50

In [56]:
import pandas as pd
import oracledb
from sqlalchemy import create_engine

In [58]:
oracledb.init_oracle_client(lib_dir=r"C:\oraclexe\app\oracle\instantclient_19_29")

In [61]:
engine = create_engine("oracle+oracledb://hr:hr@localhost:1521/xe")
oracle_con = engine.connect()

In [60]:
df_emp.to_sql('employees_oracle_source',con=engine,index=False)

-1

In [63]:
query = pd.read_sql("select * from employees_oracle_source",oracle_con)

In [70]:
df_result = df_emp[~df_emp['eno'].isin(query['eno'])]

In [71]:
df_result

   eno   ename  deptno
4    6  Robert      50

In [16]:
var = {'name':['raj','khumesh','ravindra'],
      'city':['pune','katngi','balaghat']}

In [2]:
type(var)

dict

In [6]:
var.get('name')

['raj', 'khumesh', 'ravindra']

In [8]:
var1 = {}

In [9]:
var.copy(var1)

TypeError: dict.copy() takes no arguments (1 given)

In [10]:
var1 = var.copy()

In [11]:
var1

{'name': ['raj', 'khumesh', 'ravindra'],
 'city': ['pune', 'katngi', 'balaghat']}

In [12]:
var.items()

dict_items([('name', ['raj', 'khumesh', 'ravindra']), ('city', ['pune', 'katngi', 'balaghat'])])

In [14]:
var.pop('city')

['pune', 'katngi', 'balaghat']

In [17]:
var

{'name': ['raj', 'khumesh', 'ravindra'],
 'city': ['pune', 'katngi', 'balaghat']}

In [18]:
var.update({'Subect':'maths'})

In [19]:
var

{'name': ['raj', 'khumesh', 'ravindra'],
 'city': ['pune', 'katngi', 'balaghat'],
 'Subect': 'maths'}

In [28]:
a = 10
b = 20

a== b

False

In [24]:
a is not b

True

In [25]:
a = ['raj', 'khumesh', 'ravindra']

In [26]:
'raj' in a

True

In [29]:
val = a if a > b else b

In [30]:
val

20

In [33]:
user_input = eval(input('enter value to check number even or odd: '))
if user_input%2 == 0:
    print(f'{user_input} number is even')
else:
    print(f'{user_input} number is odd')

enter value to check number even or odd:  33

33 number is odd

In [34]:
city = ['pune', 'katngi', 'balaghat']

In [36]:
if 'indore' in city:
    print('Pune is available')

In [50]:
def even_odd(n):
    for i in range(1,n+1):
        if i%2 != 0:
            print(i)

In [51]:
even_odd(10)

1
3
5
7
9

In [43]:
result

2

In [57]:
def even_odd(n):
    num = 0
    while num <= 10:
        print(num)
        num+=1

In [58]:
result = even_odd(10)

0
1
2
3
4
5
6
7
8
9
10

In [56]:
result

1

In [ ]:
 #From a given list, how to count the number of occurrences of each element in the list.
list1  = [ 1,2,3,4,5,1,2,5,5]

def list_count():
    count_element = {}
    for ele in list1: